## Import Libraries

In [3]:
# import Libraries
import pandas as pd
import numpy as np
import os
import matplotlib
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

## Import Dataframe

In [4]:
df_covid_age=pd.read_pickle(r"C:\Users\drmat\OneDrive\Documents\Career Foundry\COVID_Suicide\02 Data\02 Prepared\COVID\age_group.pkl")

## Inspect Datatframe

In [5]:
df_covid_age.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 74849223 entries, 0 to 74849224
Data columns (total 3 columns):
 #   Column              Dtype
---  ------              -----
 0   year                object
 1   state_of_residence  object
 2   age_group           object
dtypes: object(3)
memory usage: 2.2+ GB

In [6]:
df_covid_age.head()

   year state_of_residence       age_group
0  2022                 AZ       65+ years
1  2021                 NE         Unknown
2  2022                 FL  18 to 49 years
3  2021                 IL       65+ years
4  2022                 AZ       65+ years

In [7]:
# rename state column to match other dataframes
df_covid_age.rename(columns={'state_of_residence':'state'},inplace=True)

In [8]:
# create dictionary to change abbreviatiosn to full spelling inorder to match other dataframes
states={
"AL" : "Alabama",
"AK" : "Alaska",
"AZ" : "Arizona",
"AR" : "Arkansas",
"CA" : "California",
"CO" : "Colorado",
"CT" : "Connecticut",
"DE" : "Delaware",
"DC" : "District of Columbia",
"FL" : "Florida",
"GA" : "Georgia",
"HI" : "Hawaii",
"ID" : "Idaho",
"IL" : "Illinois",
"IN" : "Indiana",
"IA" : "Iowa",
"KS" : "Kansas",
"KY" : "Kentucky",
"LA" : "Louisiana",
"ME" : "Maine",
"MD" : "Maryland",
"MA" : "Massachusetts",
"MI" : "Michigan",
"MN" : "Minnesota",
"MS" : "Mississippi",
"MO" : "Missouri",
"MT" : "Montana",
"NE" : "Nebraska",
"NV" : "Nevada",
"NH" : "New Hampshire",
"NJ" : "New Jersey",
"NM" : "New Mexico",
"NY" : "New York",
"NC" : "North Carolina",
"ND" : "North Dakota",
"OH" : "Ohio",
"OK" : "Oklahoma",
"OR" : "Oregon",
"PA" : "Pennsylvania",
"RI" : "Rhode Island",
"SC" : "South Carolina",
"SD" : "South Dakota",
"TN" : "Tennessee",
"TX" : "Texas",
"UT" : "Utah",
"VT" : "Vermont",
"VA" : "Virginia",
"WA" : "Washington",
"WV" : "West Virginia",
"WI" : "Wisconsin",
"WY" : "Wyoming",

}

In [ ]:
# replace state abbreviations wtih full spelling
df['state'].replace(states, inplace=True)

In [10]:
#recehck dataframe
df_covid_age.head()

   year     state       age_group
0  2022   Arizona       65+ years
1  2021  Nebraska         Unknown
2  2022   Florida  18 to 49 years
3  2021  Illinois       65+ years
4  2022   Arizona       65+ years

In [11]:
# add aggregation column
df_covid_age['covid_cases']=1

In [12]:
#check for misssing values
df_covid_age.isnull().sum()

year           0
state          0
age_group      0
covid_cases    0
dtype: int64

In [13]:
#check for unique values
df_covid_age['year'].value_counts(dropna = False)

2021    32616464
2022    23058468
2020    19174281
nan           10
Name: year, dtype: int64

In [14]:
df_nan = df_covid_age[df_covid_age['year']=='nan']
df_nan.reset_index()

     index year state age_group  covid_cases
0  2400892  nan   nan   Unknown            1
1  2400894  nan   nan   Unknown            1
2  2400896  nan   nan   Unknown            1
3  2400898  nan   nan   Unknown            1
4  2400900  nan   nan   Unknown            1
5  2400902  nan   nan   Unknown            1
6  2400904  nan   nan   Unknown            1
7  2400906  nan   nan   Unknown            1
8  2400908  nan   nan   Unknown            1
9  2400910  nan   nan   Unknown            1

In [15]:
#check for unique values
df_covid_age['year'].value_counts(dropna = False)

2021    32616464
2022    23058468
2020    19174281
nan           10
Name: year, dtype: int64

In [16]:
#check for unique values
df_covid_age['state'].value_counts(dropna = False)

California              9526506
New York                5367915
Florida                 4609517
Texas                   4446497
Illinois                3308572
North Carolina          3168801
Pennsylvania            2908543
Ohio                    2764700
New Jersey              2426162
Georgia                 2155671
Arizona                 2054040
Tennessee               2027232
Massachusetts           1866785
Michigan                1843529
Indiana                 1752703
Virginia                1684150
Washington              1565134
South Carolina          1518574
Minnesota               1502636
Missouri                1440880
Colorado                1434381
Wisconsin               1361689
Alabama                 1299231
Louisiana               1188399
Kentucky                1038843
Maryland                 973209
Utah                     951694
Arkansas                 836616
Kansas                   792593
Oregon                   760653
Oklahoma                 723439
Nevada                   681991
New Mexico               513496
Iowa                     503477
Connecticut              455749
Idaho                    450005
Nebraska                 311604
Delaware                 268795
Maine                    254247
Rhode Island             253646
Alaska                   251541
Montana                  250587
North Dakota             243717
South Dakota             220262
Hawaii                   167032
Wyoming                  158414
District of Columbia     138254
Vermont                  120163
New Hampshire             95439
PR                        87797
Mississippi               59869
GU                        34200
Virgin Islands            18078
West Virginia             10504
nan                        1062
Name: state, dtype: int64

In [17]:
# Delete row(s) containing specific column value(s)
df_covid_age.drop(df_covid_age.index[df_covid_age['state']=='PR'],inplace=True) 
df_covid_age.reset_index(inplace=True)

In [18]:
# Delete row(s) containing specific column value(s)
df_covid_age.drop(df_covid_age.index[df_covid_age['state']=='GU'],inplace=True)

In [ ]:
# Delete row(s) containing specific column value(s)
df_covid_age.drop(df_covid_age.index[df_covid_age['state']=='VI'],inplace=True)

In [19]:
# Delete row(s) containing specific column value(s)
df_covid_age.drop(df_covid_age.index[df_covid_age['state']=='nan'],inplace=True)

In [20]:
#check for unique values
df_covid_age['state'].value_counts(dropna = False)

California              9526506
New York                5367915
Florida                 4609517
Texas                   4446497
Illinois                3308572
North Carolina          3168801
Pennsylvania            2908543
Ohio                    2764700
New Jersey              2426162
Georgia                 2155671
Arizona                 2054040
Tennessee               2027232
Massachusetts           1866785
Michigan                1843529
Indiana                 1752703
Virginia                1684150
Washington              1565134
South Carolina          1518574
Minnesota               1502636
Missouri                1440880
Colorado                1434381
Wisconsin               1361689
Alabama                 1299231
Louisiana               1188399
Kentucky                1038843
Maryland                 973209
Utah                     951694
Arkansas                 836616
Kansas                   792593
Oregon                   760653
Oklahoma                 723439
Nevada                   681991
New Mexico               513496
Iowa                     503477
Connecticut              455749
Idaho                    450005
Nebraska                 311604
Delaware                 268795
Maine                    254247
Rhode Island             253646
Alaska                   251541
Montana                  250587
North Dakota             243717
South Dakota             220262
Hawaii                   167032
Wyoming                  158414
District of Columbia     138254
Vermont                  120163
New Hampshire             95439
Mississippi               59869
Virgin Islands            18078
West Virginia             10504
Name: state, dtype: int64

In [21]:
#check for unique values
df_covid_age['age_group'].value_counts(dropna = False)

18 to 49 years    38661510
50 to 64 years    13374279
0 - 17 years      12834323
65+ years          8521617
Unknown            1334435
Name: age_group, dtype: int64

In [2]:
df_covid_age.replace(['18 to 49 years'],'18-49',inplace=True)

NameError: name 'df_covid_age' is not defined

In [ ]:
df_covid_age.replace(['65+ years'],'65+',inplace=True)

In [ ]:
df_covid_age.replace(['50 to 64 years'],'50-64',inplace=True)

In [ ]:
df_covid_age.replace(['0 - 17 years'],'0-17',inplace=True)

In [22]:
df_covid_age.head()

   index  year     state       age_group  covid_cases
0      0  2022   Arizona       65+ years            1
1      1  2021  Nebraska         Unknown            1
2      2  2022   Florida  18 to 49 years            1
3      3  2021  Illinois       65+ years            1
4      4  2022   Arizona       65+ years            1

In [24]:
df_covid_age.drop(columns=['index'], inplace=True)

In [25]:
df_pivot = df_covid_age.pivot_table(index =['year','state','age_group'],values=['covid_cases'], aggfunc ='sum')
df_pivot

                             covid_cases
year state   age_group
2020 Alabama 0 - 17 years          30459
             18 to 49 years       140794
             50 to 64 years        56072
             65+ years             45457
             Unknown               86763
...                                  ...
2022 Wyoming 0 - 17 years           6549
             18 to 49 years        19045
             50 to 64 years         6159
             65+ years              4231
             Unknown                 654

[770 rows x 1 columns]

In [26]:
df_pivot.to_excel(r'C:\Users\drmat\OneDrive\Documents\Career Foundry\COVID_Suicide\02 Data\02 Prepared\COVID\age_group_pivot2.xlsx')